#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_eks_cluster.eks-cluster: Reading...
data.aws_security_group.mctechdb_security_group: Reading...
data.aws_availability_zones.available_zones: Reading...
data.aws_vpc.vpc: Reading...
data.aws_availability_zones.available_zones: Read complete after 0s [id=us-east-1]
aws_default_subnet.subnet_az1: Refreshing state... [id=subnet-06bc9c29259a1b8aa]
aws_default_subnet.subnet_az2: Refreshing state... [id=subnet-0d7a2d72cbad29100]
data.aws_eks_cluster.eks-cluster: Read complete after 0s [id=MechTechApi]
data.aws_security_group.mctechdb_security_group: Read complete after 0s [id=sg-0e8aad7fc8bebbbf6]
data.aws_eks_cluster_auth.cluster_auth: Reading...
data.aws_eks_cluster_auth.cluster_auth: Read complete after 0s [id=MechTechApi]
data.aws_vpc.vpc: Read complete after 0s [id=vpc-09087a8211f98da81]
data.aws_subnets.subnets: Reading...
aws_security_group.redis_sg: Refreshing state... [id=sg-02b8ba8f9392c1e20]
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-0e3bd9720bd4238db"]: Reading...
data.aws_subnet.subnet["subnet-07a84bddbd722791f"]: Reading...
data.aws_subnet.subnet["subnet-0d7a2d72cbad29100"]: Reading...
data.aws_subnet.subnet["subnet-0d81ffd4d8316977e"]: Reading...
data.aws_subnet.subnet["subnet-06bc9c29259a1b8aa"]: Reading...
data.aws_subnet.subnet["subnet-00d780a2d518f5daf"]: Reading...
data.aws_subnet.subnet["subnet-0d7a2d72cbad29100"]: Read complete after 0s [id=subnet-0d7a2d72cbad29100]
data.aws_subnet.subnet["subnet-06bc9c29259a1b8aa"]: Read complete after 0s [id=subnet-06bc9c29259a1b8aa]
data.aws_subnet.subnet["subnet-0d81ffd4d8316977e"]: Read complete after 0s [id=subnet-0d81ffd4d8316977e]
data.aws_subnet.subnet["subnet-0e3bd9720bd4238db"]: Read complete after 0s [id=subnet-0e3bd9720bd4238db]
data.aws_subnet.subnet["subnet-07a84bddbd722791f"]: Read complete after 0s [id=subnet-07a84bddbd722791f]
data.aws_subnet.subnet["subnet-00d780a2d518f5daf"]: Read complete after 0s [id=subnet-00d780a2d518f5daf]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.mctechdb_instance will be created
  + resource "aws_db_instance" "mctechdb_instance" {
      + address                               = (known after apply)
      + allocated_storage                     = 50
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = "us-east-1a"
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "sqlserver-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "sqlserver-ex"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "15.00"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "mctech-sqlserverdb-rds-instance"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "mctech"
      + vpc_security_group_ids                = [
          + "sg-0e8aad7fc8bebbbf6",
        ]
    }

  # aws_db_subnet_group.sqlserver_subnet_group will be created
  + resource "aws_db_subnet_group" "sqlserver_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "sqlserver-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-00d780a2d518f5daf",
          + "subnet-06bc9c29259a1b8aa",
          + "subnet-07a84bddbd722791f",
          + "subnet-0d7a2d72cbad29100",
          + "subnet-0d81ffd4d8316977e",
          + "subnet-0e3bd9720bd4238db",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "SqlServerSubnetGroup"
        }
      + tags_all                = {
          + "Name" = "SqlServerSubnetGroup"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_elasticache_cluster.redis will be created
  + resource "aws_elasticache_cluster" "redis" {
      + apply_immediately          = (known after apply)
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = (known after apply)
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "mctech-cart-cluster"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = (known after apply)
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = (known after apply)
      + network_type               = (known after apply)
      + node_type                  = "cache.t2.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = (known after apply)
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = [
          + "sg-0e8aad7fc8bebbbf6",
        ]
      + snapshot_window            = (known after apply)
      + subnet_group_name          = "redis-subnet-group"
      + tags                       = {
          + "Name" = "McTechCartRedisCluster"
        }
      + tags_all                   = {
          + "Name" = "McTechCartRedisCluster"
        }
      + transit_encryption_enabled = (known after apply)
    }

  # aws_elasticache_subnet_group.redis_subnet_group will be created
  + resource "aws_elasticache_subnet_group" "redis_subnet_group" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "redis-subnet-group"
      + subnet_ids  = [
          + "subnet-00d780a2d518f5daf",
          + "subnet-06bc9c29259a1b8aa",
          + "subnet-07a84bddbd722791f",
          + "subnet-0d7a2d72cbad29100",
          + "subnet-0d81ffd4d8316977e",
          + "subnet-0e3bd9720bd4238db",
        ]
      + tags        = {
          + "Name" = "redis-subnet-group"
        }
      + tags_all    = {
          + "Name" = "redis-subnet-group"
        }
      + vpc_id      = (known after apply)
    }

  # kubernetes_secret.mctechapi_secret will be created
  + resource "kubernetes_secret" "mctechapi_secret" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "mctechapi-secret"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.mctechcart_secret will be created
  + resource "kubernetes_secret" "mctechcart_secret" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "mctechcart-secret"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.mctechpayments_secret will be created
  + resource "kubernetes_secret" "mctechpayments_secret" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "mctechpayments-secret"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + redis_endpoint   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @josemrl7, Action: `pull_request`*